In [1]:
import pandas as pd

In [53]:
df = pd.read_csv('../datasets/census/census-income.data', na_values=[" ?"],
                 names=['AAGE', 'ACLSWKR', 'ADTIND', 'ADTOCC', 'AGI', 'AHGA', 'AHRSPAY', 'AHSCOL', 'AMARITL', 'AMJIND', 'AMJOCC', 'ARACE', 'AREORGN', 'ASEX', 'AUNMEM', 'AUNTYPE', 'AWKSTAT', 'CAPGAIN', 'CAPLOSS', 'DIVVAL', 'FEDTAX', 'FILESTAT', 'GRINREG', 'GRINST', 'HHDFMX', 'HHDREL', 'MARSUPWT', 'MIGMTR1', 'MIGMTR3', 'MIGMTR4', 'MIGSAME', 'MIGSUN', 'NOEMP', 'PARENT', 'PEARNVAL', 'PEFNTVTY', 'PEMNTVTY', 'PENATVTY', 'PRCITSHP', 'PTOTVAL', 'SEOTR', 'TAXINC', 'VETQVA', 'VETYN', 'WKSWORK'])

In [54]:
df.head(n=2)

,AAGE,ACLSWKR,ADTIND,ADTOCC,AGI,AHGA,AHRSPAY,AHSCOL,AMARITL,AMJIND,...,PEFNTVTY,PEMNTVTY,PENATVTY,PRCITSHP,PTOTVAL,SEOTR,TAXINC,VETQVA,VETYN,WKSWORK
0,73,Not in universe,0,0,High school graduate,0,Not in universe,Widowed,Not in universe or children,Not in universe,...,Native- Born in the United States,0,Not in universe,2,0,95,- 50000.,NaN,NaN,NaN
1,58,Self-employed-not incorporated,4,34,Some college but no degree,0,Not in universe,Divorced,Construction,Precision production craft & repair,...,Native- Born in the United States,0,Not in universe,2,52,94,- 50000.,NaN,NaN,NaN

In [48]:
x = df.isnull().sum()
x[20:]

20        0
21      708
22        0
23        0
24        0
25    99696
26    99696
27    99696
28        0
29    99696
30        0
31        0
32     6713
33     6119
34     3393
35        0
36        0
37        0
38        0
39        0
40        0
41        0
dtype: int64

In [50]:
df.shape

(199523, 42)

In [57]:
print(len([vars for vars in df.columns if df[vars].dtype == 'object']))

29